In [9]:
import pandas as pd

In [34]:
name = ['Reddy','Manju','Balu','jagathi','srikanth']
age = [23,24,25,28,24]
name,age

(['Reddy', 'Manju', 'Balu', 'jagathi', 'srikanth'], [23, 24, 25, 28, 24])

In [35]:
pd.DataFrame(zip(name,age))

          0   1
0     Reddy  23
1     Manju  24
2      Balu  25
3   jagathi  28
4  srikanth  24

In [36]:
data=zip(name,age)
cols=['name','age']
pd.DataFrame(data,columns=cols)

       name  age
0     Reddy   23
1     Manju   24
2      Balu   25
3   jagathi   28
4  srikanth   24

In [37]:
data = zip(name,age)
cols = ['name','age']
ind = ['A','B','C','D','E']
pd.DataFrame(data,
             columns=cols,
             index=ind)

       name  age
A     Reddy   23
B     Manju   24
C      Balu   25
D   jagathi   28
E  srikanth   24

In [38]:
name = ['Reddy','Manju','Balu','jagathi','srikanth']
age = [23,24,25,28,24]
data = zip(name,age)
cols = ['name','age']
ind = ['A','B','C','D','E']
df = pd.DataFrame(data,columns=cols,index=ind)
df

       name  age
A     Reddy   23
B     Manju   24
C      Balu   25
D   jagathi   28
E  srikanth   24

In [39]:
city_name = ['Brpalli','Lrpalli','Rayachoti','Galiveedu','Banglore']
df['city'] = city_name
df

       name  age       city
A     Reddy   23    Brpalli
B     Manju   24    Lrpalli
C      Balu   25  Rayachoti
D   jagathi   28  Galiveedu
E  srikanth   24   Banglore

In [40]:
df['name'] = ['Gangi','Vijay','Teja','Megha','Pavan']
df

    name  age       city
A  Gangi   23    Brpalli
B  Vijay   24    Lrpalli
C   Teja   25  Rayachoti
D  Megha   28  Galiveedu
E  Pavan   24   Banglore

In [41]:
df.drop('city',
        axis=1)
       #inplace=True)

    name  age
A  Gangi   23
B  Vijay   24
C   Teja   25
D  Megha   28
E  Pavan   24

In [53]:
df.drop('E',
       axis=0)

    name  age       city
A  Gangi   23    Brpalli
B  Vijay   24    Lrpalli
C   Teja   25  Rayachoti
D  Megha   28  Galiveedu

In [221]:
df.to_csv("list.csv",index=False)

In [222]:
pd.read_csv("list.csv")

    name  age       city
0  Gangi   23    Brpalli
1  Vijay   24    Lrpalli
2   Teja   25  Rayachoti
3  Megha   28  Galiveedu
4  Pavan   24   Banglore

In [158]:
d1 ={"name" :['Reddy','Manju','Balu','jagathi','srikanth']}
d2 = {"age" :[23,24,25,28,24]}
d1,d2

({'name': ['Reddy', 'Manju', 'Balu', 'jagathi', 'srikanth']},
 {'age': [23, 24, 25, 28, 24]})

In [162]:
pd.DataFrame(zip(d1['name'],d2['age']),
columns=['name','age'])# zip file is working in dict
#df = pd.DataFrame({'Name': d1['name'], 'Age': d2['age']})
#df

       name  age
0     Reddy   23
1     Manju   24
2      Balu   25
3   jagathi   28
4  srikanth   24

In [152]:
df = pd.DataFrame(d1,index=['A','B','C','D','E'])

In [153]:
df['age'] = d2['age']
print(df)

       name  age
A     Reddy   23
B     Manju   24
C      Balu   25
D   jagathi   28
E  srikanth   24

In [154]:
d2 = {"city_name" : ['Brpalli','Lrpalli','Rayachoti','Galiveedu','Banglore']}
df['city'] = d2['city_name']
df

       name  age       city
A     Reddy   23    Brpalli
B     Manju   24    Lrpalli
C      Balu   25  Rayachoti
D   jagathi   28  Galiveedu
E  srikanth   24   Banglore

In [3]:
d2 = {"city_name" : ['Brpalli','Lrpalli','Rayachoti','Galiveedu','Banglore']}
d2['city_name']

['Brpalli', 'Lrpalli', 'Rayachoti', 'Galiveedu', 'Banglore']

In [1]:
d2['city_name']

NameError: name 'd2' is not defined

In [216]:
d4 = {'name': ['Gangi','Vijay','Teja','Megha','Pavan']}
df['name'] = d4['name']
df

    name  age       city
A  Gangi   23    Brpalli
B  Vijay   24    Lrpalli
C   Teja   25  Rayachoti
D  Megha   28  Galiveedu
E  Pavan   24   Banglore

In [217]:
df.drop('age',
       axis=1)

    name       city
A  Gangi    Brpalli
B  Vijay    Lrpalli
C   Teja  Rayachoti
D  Megha  Galiveedu
E  Pavan   Banglore

In [218]:
df.drop('D',
       axis=0)

    name  age       city
A  Gangi   23    Brpalli
B  Vijay   24    Lrpalli
C   Teja   25  Rayachoti
E  Pavan   24   Banglore

In [219]:
df.to_csv("list and dict.csv",index=False)

In [220]:
pd.read_csv("list and dict.csv")

    name  age       city
0  Gangi   23    Brpalli
1  Vijay   24    Lrpalli
2   Teja   25  Rayachoti
3  Megha   28  Galiveedu
4  Pavan   24   Banglore